Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main (InputLayer)                (None, 5, 5, 1)       0                                            
____________________________________________________________________________________________________
aux (InputLayer)                 (None, 5, 5, 3)       0                                            
____________________________________________________________________________________________________
generator (Model)                (None, 15, 15, 1)     159887      main[0][0]                       
                                                                   aux[0][0]                        
____________________________________________________________________________________________________
discriminator (Sequential)       (None, 1)             94593       generator[3][0]                  
====================================================================================================
Total params: 254,480
Trainable params: 159,357
Non-trainable params: 95,123
____________________________________________________________________________________________________
