_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_26 (Conv2D)           (None, 8, 8, 32)          320       
_________________________________________________________________
leaky_re_lu_26 (LeakyReLU)   (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 4, 4, 64)          18496     
_________________________________________________________________
zero_padding2d_9 (ZeroPaddin (None, 5, 5, 64)          0         
_________________________________________________________________
leaky_re_lu_27 (LeakyReLU)   (None, 5, 5, 64)          0         
_________________________________________________________________
batch_normalization_17 (Batc (None, 5, 5, 64)          256       
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 3, 3, 128)         73856     
_________________________________________________________________
leaky_re_lu_28 (LeakyReLU)   (None, 3, 3, 128)         0         
_________________________________________________________________
batch_normalization_18 (Batc (None, 3, 3, 128)         512       
_________________________________________________________________
flatten_9 (Flatten)          (None, 1152)              0         
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 1153      
=================================================================
Total params: 94,593
Trainable params: 94,209
Non-trainable params: 384
_________________________________________________________________