____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
main_input (InputLayer)          (None, 5, 5, 1)       0                                            
____________________________________________________________________________________________________
auxiliary_input (InputLayer)     (None, 5, 5, 3)       0                                            
____________________________________________________________________________________________________
concatenate (Concatenate)        (None, 5, 5, 4)       0           main_input[0][0]                 
                                                                   auxiliary_input[0][0]            
____________________________________________________________________________________________________
reshape_flat_res (Reshape)       (None, 100)           0           concatenate[0][0]                
____________________________________________________________________________________________________
repeate_res (RepeatVector)       (None, 9, 100)        0           reshape_flat_res[0][0]           
____________________________________________________________________________________________________
permute_res (Permute)            (None, 100, 9)        0           repeate_res[0][0]                
____________________________________________________________________________________________________
reshape_back_res (Reshape)       (None, 5, 5, 36)      0           permute_res[0][0]                
____________________________________________________________________________________________________
conv2D_0 (Conv2D)                (None, 5, 5, 64)      20800       reshape_back_res[0][0]           
____________________________________________________________________________________________________
normalize_0 (BatchNormalization) (None, 5, 5, 64)      256         conv2D_0[0][0]                   
____________________________________________________________________________________________________
conv2D_1 (Conv2D)                (None, 5, 5, 128)     73856       normalize_0[0][0]                
____________________________________________________________________________________________________
normalize_1 (BatchNormalization) (None, 5, 5, 128)     512         conv2D_1[0][0]                   
____________________________________________________________________________________________________
reshape_flat (Reshape)           (None, 25)            0           main_input[0][0]                 
____________________________________________________________________________________________________
deconv2D_0 (Conv2DTranspose)     (None, 5, 5, 64)      73792       normalize_1[0][0]                
____________________________________________________________________________________________________
repeate (RepeatVector)           (None, 9, 25)         0           reshape_flat[0][0]               
____________________________________________________________________________________________________
normalize_2 (BatchNormalization) (None, 5, 5, 64)      256         deconv2D_0[0][0]                 
____________________________________________________________________________________________________
permute (Permute)                (None, 25, 9)         0           repeate[0][0]                    
____________________________________________________________________________________________________
deconv2D_1 (Conv2DTranspose)     (None, 5, 5, 9)       5193        normalize_2[0][0]                
____________________________________________________________________________________________________
reshape_back (Reshape)           (None, 5, 5, 9)       0           permute[0][0]                    
____________________________________________________________________________________________________
normalize_3 (BatchNormalization) (None, 5, 5, 9)       36          deconv2D_1[0][0]                 
____________________________________________________________________________________________________
add (Add)                        (None, 5, 5, 9)       0           reshape_back[0][0]               
                                                                   normalize_3[0][0]                
____________________________________________________________________________________________________
activation (Activation)          (None, 5, 5, 9)       0           add[0][0]                        
____________________________________________________________________________________________________
subpixel_conv (Subpixel)         (None, 15, 15, 1)     738         activation[0][0]                 
====================================================================================================
Total params: 175,439
Trainable params: 174,909
Non-trainable params: 530
____________________________________________________________________________________________________