Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
auxiliary_input (InputLayer)     (None, 5, 5, 4)       0                                            
____________________________________________________________________________________________________
conv2D_0 (Conv2D)                (None, 5, 5, 16)      592         auxiliary_input[0][0]            
____________________________________________________________________________________________________
normalize_0 (BatchNormalization) (None, 5, 5, 16)      64          conv2D_0[0][0]                   
____________________________________________________________________________________________________
conv2D_1 (Conv2D)                (None, 5, 5, 32)      4640        normalize_0[0][0]                
____________________________________________________________________________________________________
normalize_1 (BatchNormalization) (None, 5, 5, 32)      128         conv2D_1[0][0]                   
____________________________________________________________________________________________________
deconv2D_0 (Conv2DTranspose)     (None, 5, 5, 16)      4624        normalize_1[0][0]                
____________________________________________________________________________________________________
normalize_2 (BatchNormalization) (None, 5, 5, 16)      64          deconv2D_0[0][0]                 
____________________________________________________________________________________________________
main (InputLayer)                (None, 40, 3)         0                                            
____________________________________________________________________________________________________
deconv2D_1 (Conv2DTranspose)     (None, 5, 5, 4)       580         normalize_2[0][0]                
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 120)           0           main[0][0]                       
____________________________________________________________________________________________________
normalize_3 (BatchNormalization) (None, 5, 5, 4)       16          deconv2D_1[0][0]                 
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 100)           12100       flatten_1[0][0]                  
____________________________________________________________________________________________________
reshape_1 (Reshape)              (None, 100)           0           normalize_3[0][0]                
____________________________________________________________________________________________________
concatenate (Concatenate)        (None, 200)           0           dense_1[0][0]                    
                                                                   reshape_1[0][0]                  
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 100)           20100       concatenate[0][0]                
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 120)           12120       dense_2[0][0]                    
____________________________________________________________________________________________________
reshape_2 (Reshape)              (None, 40, 3)         0           dense_3[0][0]                    
====================================================================================================
Total params: 55,028
Trainable params: 54,892
Non-trainable params: 136
____________________________________________________________________________________________________